browser-load-test.yml
config:
  target: "https://artillery.io"
  phases:
    - arrivalRate: 1
      duration: 3
  engines:
    playwright:
      launchOptions:
        headless: false
  processor: ./flows.js
scenarios:
  - name: "Dev account signup"
    engine: playwright
    flowFunction: "devAccountSignupFlow"
    flow: []